Reports/бит_ВыпискаИзДомовойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ВыпискаИзДомовойКниги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНаОдного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ГражданствоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГражданствоПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаМедицинскоеСтрахование</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ТрудоваяДеятельностьПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ТрудоваяДеятельностьПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганизацииТрудовойЗанятостиПроживающих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидыЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЗанятостиПроживающих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодЗанятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/бит_ВыпискаИзДомовойКниги/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мСписокФизЛиц Экспорт; // Хранит список физических лиц.

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура формирует отчет.
// Параметры:
// ТаблицаРезультат - табличное поле документа;.
// ВариантМакета - выбор варианта макета  для вывода в табличное поле.
Процедура СформироватьОтчет(ТаблицаРезультат, ВариантМакета) Экспорт
	
	мСписокФизЛиц = СписокПроживающих();
	
	ТаблицаРезультат.Очистить();
	Отказ = Ложь;
	ПроверкаШапки(Отказ);
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Получим подробный адрес дома.
	ПочтовыйАдресЗдания = ПодробныйАдрес(ЛицевойСчет.Здание);
	
	// БИТ_ЖКХ добавление кода Начало: 05.06.2012 
	// Вызов функции формирования списка проживающих. 
	Таблица = ФормироватьСписокОсновныхДанных();
	ТаблицаДанных = АдресаПрибытияУбытия(Дата,ЛицевойСчет);
	
	Если ВариантМакета = "ВыпискаИзДомовойКниги" Тогда
		
		Макет = ПолучитьМакет("ВыпискаИзДомовойКниги");
		
		ОбластьШапка    = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаб");
		ОбластьШапкаТаб.Защита = Истина;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		// БИТ_ЖКХ добавление кода Начало: 05.06.2012 
		Если ИсторияПрописки Тогда
			
			ОбластьПодСтрока = Макет.ПолучитьОбласть("ПодстрокаРасшифровки");
			
		КонецЕсли; 
		// БИТ_ЖКХ добавление кода конец : 05.06.2012
		
		ОбластьШапка.Параметры.Номер       = Номер;
		// БИТ_ЖКХ изменения кода . Начало: 06.06.2012
		ОбластьШапка.Параметры.НомерДома   = Строка(ЛицевойСчет.Здание) 
		+ ?(ЗначениеЗаполнено(ЛицевойСчет.Здание.Корпус),", корп." + Строка(ЛицевойСчет.Здание.Корпус),"");

		// БИТ_ЖКХ изменения кода . Конец  06.06.2012
		ОбластьШапка.Параметры.Улица       = ЛицевойСчет.УлицаЛицевогоСчета;
		
		Если ПочтовыйАдресЗдания.Следующий() Тогда
			// БИТ ЖКХ 26.01.2021
			//ОбластьШапка.Параметры.Город =  ?(ЗначениеЗаполнено(ПочтовыйАдресЗдания.Город),ПочтовыйАдресЗдания.Город,ПочтовыйАдресЗдания.Регион);
			если ЗначениеЗаполнено(ЛицевойСчет.Здание.КонтактнаяИнформация) И
				  ЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 тогда
			 ОбластьШапка.Параметры.Город = ПолучитьАдресДляСправки(строка(ЛицевойСчет.Здание.КонтактнаяИнформация[0].Значение));
			иначе			 
			 ОбластьШапка.Параметры.Город =  ?(ЗначениеЗаполнено(ПочтовыйАдресЗдания.Город), ПочтовыйАдресЗдания.Объект.ПочтовыйАдрес,ПочтовыйАдресЗдания.Регион);			    
		    конецесли;
		 
		КонецЕсли;
		
		ТаблицаРезультат.Вывести(ОбластьШапка);
		ТаблицаРезультат.Вывести(ОбластьШапкаТаб);
		НомерСтроки = 0;
		
		// Цикл заполнения макета.	                                                  
		Для каждого Строка_ Из мСписокФизЛиц Цикл
			АдресПрибытияИзСправочника = Неопределено;
			
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРазшифровки");
			Строка = Таблица.Найти(Строка_.ФизЛицо,"ФизЛицо");
			Отбор = Новый Структура;
			Отбор.Вставить("ФизЛицо",Строка_.ФизЛицо);
			СтрокиМассив = Таблица.НайтиСтроки(Отбор);
			СтрокиДанных = ТаблицаДанных.НайтиСтроки(Отбор);
			Индекс = 0;
			Если СтрокиМассив.Количество() > 0 Тогда                          
				
				Выборка = Новый Структура;
				Для каждого СтрокаМассив_ Из СтрокиМассив Цикл
					СтрокаВидСведений = СтрокаМассив_.ВидСведений;
					
					Если СтрокаВидСведений <> Null Тогда
						
						ПредопределенныеИзПВХ = ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.ПолучитьИмяПредопределенного(СтрокаВидСведений);
						Если ПредопределенныеИзПВХ = "КогдаИОткудаПрибыл" Тогда
							
							АдресПрибытияИзСправочника = СтрокаМассив_.Значение;
							
						КонецЕсли;
						Если ЗначениеЗаполнено(ПредопределенныеИзПВХ) Тогда
							ДанныеПВХ =  ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих;
							Выборка.Вставить(ПредопределенныеИзПВХ,СтрокаМассив_.Значение);
							ОбластьСтрока.Параметры.Заполнить(Выборка);
						КонецЕсли; 
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли; 
			
			// Заполнение параметров макета.
			
			// БИТ_ЖКХ изменения кода - МестоРождения. Начало: 05.06.2012
			Если ЗначениеЗаполнено(Строка.МестоРождения) Тогда
				
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Строка.МестоРождения, Истина);
				
			Иначе
				
				МестоРождения = "";
				
			КонецЕсли; 
			
			// Заполнение столбца с ФИО, местом рождения, семейным положением.
			
			ОбластьСтрока.Параметры.Заполнить(Строка);
			// БИТ_ЖКХ изменения кода . Начало: 07.06.2012
			
			ПолноеФИО = СокрЛП(Строка(Строка_.Фамилия + " " + Строка_.Имя + " " + Строка_.Отчество));
			
			
			Если НЕ ЗначениеЗаполнено(СокрЛП(ПолноеФИО)) Тогда
				
				ПолноеФИО =  Строка.ФизЛицо.Наименование;
				
			КонецЕсли; 
			
			Если Выборка.Свойство("СемейноеПоложение") Тогда
				
				ОбластьСтрока.Параметры.ЛичныеДанные = ПолноеФИО +  " " + МестоРождения
				+ ", " + Выборка["СемейноеПоложение"];
			Иначе
				ОбластьСтрока.Параметры.ЛичныеДанные = ПолноеФИО + " " + МестоРождения;
				
			КонецЕсли; 
			// БИТ_ЖКХ изменения кода . Конец  05.06.2012 И  07.06.2012
			
			ОбластьСтрока.Параметры.ВидДеятельности = "";
			
			Если ЗначениеЗаполнено(Строка.РодЗанятий) Тогда
				ОбластьСтрока.Параметры.ВидДеятельности = Строка.РодЗанятий;
			КонецЕсли;
			Если ЗначениеЗаполнено(Строка.Должность) И СтрДлина(ОбластьСтрока.Параметры.ВидДеятельности) > 0 Тогда
				ОбластьСтрока.Параметры.ВидДеятельности = ОбластьСтрока.Параметры.ВидДеятельности + ", " + Строка.Должность;
			Иначе
				Если ЗначениеЗаполнено(Строка.Должность) Тогда
					ОбластьСтрока.Параметры.ВидДеятельности = Строка.Должность;
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(Строка.МестоРаботы) И СтрДлина(ОбластьСтрока.Параметры.ВидДеятельности) > 0 Тогда
				ОбластьСтрока.Параметры.ВидДеятельности = ОбластьСтрока.Параметры.ВидДеятельности + ", " + Строка.МестоРаботы;
			Иначе
				Если ЗначениеЗаполнено(Строка.МестоРаботы) Тогда
					ОбластьСтрока.Параметры.ВидДеятельности = Строка.МестоРаботы;
				КонецЕсли;				
			КонецЕсли;
			// БИТ_ЖКХ_09082013_окончание_изменений
			
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НомерПП          = НомерСтроки;
			Если ЗначениеЗаполнено(Строка.ДокументВид) Тогда
				ОбластьСтрока.Параметры.ПаспортныеДанные = Строка(Строка.ДокументВид)
				+?(ЗначениеЗаполнено(Строка.ПаспортСерия), " сер." + Строка.ПаспортСерия, "")
				+?(ЗначениеЗаполнено(Строка.ПаспортНомер), " " + Строка.ПаспортНомер , "")
				+?(ЗначениеЗаполнено(Строка.ПаспортДатаВыдачи), ", выд." + Формат(Строка.ПаспортДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'"), "")
				+?(ЗначениеЗаполнено(Строка.ПаспортКемВыдан), " " + Строка.ПаспортКемВыдан, "");
				// БИТ_ЖКХ изменения кода . Конец  07.06.2012
			Иначе 
				ОбластьСтрока.Параметры.ПаспортныеДанные = Неопределено;
				
			КонецЕсли;
			
			// БИТ_ЖКХ_09082013_начало_изменений
			Если ЗначениеЗаполнено(Строка.ОтношениеКВоинскойОбязанности)
				ИЛИ ЗначениеЗаполнено(Строка.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета) Тогда
				Если Строка.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета = Перечисления.бит_ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета.ПринятНаВоинскийУчет Тогда
					ОбластьСтрока.Параметры.ОтношениеКВоеннойСлужбе = 
					?(ЗначениеЗаполнено(Строка.ОтношениеКВоинскойОбязанности), Строка(Строка.ОтношениеКВоинскойОбязанности) + ",", "")
					+ ?(ЗначениеЗаполнено(Строка.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета), " " + Строка.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета, "")
					+ ?(ЗначениеЗаполнено(Строка.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета), " " + Формат(Строка.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета, "ДФ='dd.MM.yyyy ""г.""'"), "");
				Иначе
					ОбластьСтрока.Параметры.ОтношениеКВоеннойСлужбе = 
					?(ЗначениеЗаполнено(Строка.ОтношениеКВоинскойОбязанности), Строка.ОтношениеКВоинскойОбязанности, "");
				КонецЕсли;
			Иначе
				ОбластьСтрока.Параметры.ОтношениеКВоеннойСлужбе = "";
			КонецЕсли;
			// БИТ_ЖКХ_09082013_окончание_изменений
			
			// БИТ_ЖКХ добавление кода Начало: 06.06.2012 
			Для каждого СтрокаИзДанных Из СтрокиДанных Цикл
				ОбластьСтрока.Параметры.Заполнить(СтрокаИзДанных);
			КонецЦикла;  
			
			// БИТ_ЖКХ добавление кода Начало: 05.06.2012 
			Если ИсторияПрописки Тогда
				
				Если СтрокиДанных.Количество()> 0 Тогда
					СчетчикСтрок = 0;
					
					Для каждого Строка Из СтрокиДанных Цикл
						
						Если СчетчикСтрок = 0 Тогда
							
							ОбластьСтрока.Параметры.Заполнить(Строка);
							ТаблицаРезультат.Вывести(ОбластьСтрока);
							
						Иначе
							ОбластьПодСтрока.Параметры.Заполнить(Строка);
							ТаблицаРезультат.Вывести(ОбластьПодСтрока);
						КонецЕсли; 
						
						СчетчикСтрок = СчетчикСтрок + 1;
					КонецЦикла; 
					
				КонецЕсли; 
			Иначе
				
				// БИТ_ЖКХ добавление кода Начало: 08.06.2012 
				Если ЗначениеЗаполнено(АдресПрибытияИзСправочника) Тогда
					
					ОбластьСтрока.Параметры.КогдаИОткудаПрибыл = АдресПрибытияИзСправочника;
					
				КонецЕсли; 
				// БИТ_ЖКХ добавление кода конец : 08.06.2012
				//	ТаблицаДанных = АдресаПрибытияУбытия(Дата,ЛицевойСчет);.
				ТаблицаРезультат.Вывести(ОбластьСтрока);
				
			КонецЕсли; 
			// БИТ_ЖКХ добавление кода конец : 05.06.2012
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy") ;
		
		// БИТ_ЖКХ добавление кода Начало: 05.06.2012 
		Отбор = Новый Структура;
		Отбор.Вставить("СтруктурнаяЕдиница",ЛицевойСчет.Организация);
		Отбор.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизаций.бит_Паспортист);
		ОтветственныеЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Отбор);
		
		ПаспортистФИО = "";
		Если ОтветственныеЛица.Количество() > 0 Тогда
			ПаспортистФИО =  ОтветственныеЛица[0].ФизическоеЛицо;
			КраткоеФИО = бит_ПаспортныйСтолСервер.ПолучитьСокращенноеФИО(ПаспортистФИО,Дата, Истина);
			Если ЗначениеЗаполнено(КраткоеФИО) Тогда
				
				ПаспортистФИО = КраткоеФИО;
				
			КонецЕсли; 
		КонецЕсли; 
		ОбластьПодвал.Параметры.ПаспортистФИО = ПаспортистФИО;
		// БИТ_ЖКХ добавление кода конец : 05.06.2012
		
		ТаблицаРезультат.Вывести(ОбластьПодвал);
		
	Иначе
		
		Макет = ПолучитьМакет("ДомоваяКнига");
		// БИТ_ЖКХ добавление кода Начало: 14.06.2012 
		ТаблицаВладельцев = СписокВладельцев();
		// БИТ_ЖКХ добавление кода конец : 14.06.2012
		
		ОбластьШапка    		= Макет.ПолучитьОбласть("Шапка");
		ОбластьРаздел1 			= Макет.ПолучитьОбласть("Раздел1");
		ОбластьРаздел2 			= Макет.ПолучитьОбласть("Раздел2");
		
		// Заполнение первой страницы.
		// БИТ_ЖКХ изменения кода . Начало: 11.11.2011
		Если ЗначениеЗаполнено(ЛицевойСчет.Здание.Корпус) Тогда
			ОбластьШапка.Параметры.Здание	 	= Строка(ЛицевойСчет.Здание) + ", корп." + ЛицевойСчет.Здание.Корпус;
		Иначе
			ОбластьШапка.Параметры.Здание	 	= Строка(ЛицевойСчет.Здание);
		КонецЕсли; 
		// БИТ_ЖКХ изменения кода . Конец  11.11.2011
		ОбластьШапка.Параметры.Квартира 	= ЛицевойСчет.Квартира;
		ОбластьШапка.Параметры.Улица 		= ЛицевойСчет.УлицаЛицевогоСчета;
		ТаблицаРезультат.Вывести(ОбластьШапка);
		ОбластьШапка.Защита = Истина;
		
		ТаблицаРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТаблицаРезультат.Вывести(ОбластьРаздел1);
		НомерСтроки = 0;  
		
		Для каждого Строка_ Из ТаблицаВладельцев Цикл
			
			ОбластьДанныеРаздел1 = Макет.ПолучитьОбласть("ДанныеРаздел1");
			НомерСтроки = НомерСтроки + 1;
			ОбластьДанныеРаздел1.Параметры.НомерПП = НомерСтроки;
			ОбластьДанныеРаздел1.Параметры.Заполнить(Строка_);
			ТаблицаРезультат.Вывести(ОбластьДанныеРаздел1);
			
		КонецЦикла; 
		
		ТаблицаРезультат.Вывести(ОбластьРаздел2);
		НомерСтроки = 0;
		
		Для каждого Строка_ Из мСписокФизЛиц Цикл
			ОбластьДанныеРаздел2 	= Макет.ПолучитьОбласть("ДанныеРаздел2");
			
			Строка 			= Таблица.Найти(Строка_.ФизЛицо,"ФизЛицо");
			// БИТ_ЖКХ добавление кода Начало: 07.06.2012
			Отбор = Новый Структура;
			Отбор.Вставить("ФизЛицо",Строка_.ФизЛицо);
			СтрокиДанных = ТаблицаДанных.НайтиСтроки(Отбор);
			
			// БИТ_ЖКХ добавление кода конец : 07.06.2012
			НомерСтроки = НомерСтроки + 1;
			ОбластьДанныеРаздел2.Параметры.НомерПП = НомерСтроки;
			
			// БИТ_ЖКХ изменения кода МестоРождения. Начало: 05.06.2012
			Если ЗначениеЗаполнено(Строка.МестоРождения) Тогда
				
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Строка.МестоРождения, Истина);
				
			Иначе
				
				МестоРождения = "";
				
			КонецЕсли; 
			// БИТ_ЖКХ добавление кода Начало: 07.06.2012 
			ПолноеФИО = Строка_.Фамилия + " " + Строка_.Имя + " " + Строка_.Отчество;
			Если НЕ ЗначениеЗаполнено(СокрЛП(ПолноеФИО)) Тогда
				
				ПолноеФИО =  Строка.ФизЛицо.Наименование;
			КонецЕсли;
			ОбластьДанныеРаздел2.Параметры.ЛичныеДанные = ПолноеФИО + ?(ЗначениеЗаполнено(МестоРождения),", " + МестоРождения, "");
			
			Если ЗначениеЗаполнено(Строка.ДокументВид) Тогда
				
				ОбластьДанныеРаздел2.Параметры.ПаспортныеДанные = Строка(Строка.ДокументВид)
				+?(ЗначениеЗаполнено(Строка.ПаспортСерия), " сер." + Строка.ПаспортСерия, "")
				+?(ЗначениеЗаполнено(Строка.ПаспортНомер), " " + Строка.ПаспортНомер , "")
				+?(ЗначениеЗаполнено(Строка.ПаспортДатаВыдачи), ", выд." + Формат(Строка.ПаспортДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'"), "")
				+?(ЗначениеЗаполнено(Строка.ПаспортКемВыдан), " " + Строка.ПаспортКемВыдан, "");
				
			Иначе ОбластьДанныеРаздел2.Параметры.ПаспортныеДанные = Неопределено;
				
			КонецЕсли; 
			Отбор = Новый Структура;
			Отбор.Вставить("ФизЛицо",Строка_.ФизЛицо);
			СтрокиМассив = Таблица.НайтиСтроки(Отбор);
			Индекс = 0;
			// БИТ_ЖКХ добавление кода Начало: 08.06.2012 
			АдресПрибытияИзСправочника = Неопределено;
			// БИТ_ЖКХ добавление кода конец : 08.06.2012
			Если СтрокиМассив.Количество() > 0 Тогда                          
				
				Выборка = Новый Структура;
				Для каждого СтрокаМассив_ Из СтрокиМассив Цикл
					СтрокаВидСведений = СтрокаМассив_.ВидСведений;
					
					Если СтрокаВидСведений <> Null Тогда
						
						ПредопределенныеИзПВХ = ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.ПолучитьИмяПредопределенного(СтрокаВидСведений);
						Если ЗначениеЗаполнено(ПредопределенныеИзПВХ) Тогда
							// БИТ_ЖКХ добавление кода Начало: 08.06.2012 
							Если ПредопределенныеИзПВХ = "КогдаИОткудаПрибыл" Тогда
								
								АдресПрибытияИзСправочника = СтрокаМассив_.Значение;
								
							КонецЕсли;
							// БИТ_ЖКХ добавление кода конец : 08.06.2012
							ДанныеПВХ =  ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих;
							Выборка.Вставить(ПредопределенныеИзПВХ,СтрокаМассив_.Значение);
							ОбластьДанныеРаздел2.Параметры.Заполнить(Выборка);
							
						КонецЕсли; 
						
					КонецЕсли;
					
					ОбластьДанныеРаздел2.Параметры.Заполнить(СтрокаМассив_);
					
				КонецЦикла;
				
			Для каждого СтрокаИзДанных Из СтрокиДанных Цикл
				ОбластьДанныеРаздел2.Параметры.Заполнить(СтрокаИзДанных);
			КонецЦикла;  
				
				// Заполнение параметров макета.
				
			КонецЕсли;                               
			
			Если СтрокиДанных.Количество()> 0 Тогда
				Если ИсторияПрописки Тогда
					
					ОбластьПодСтрока 	= Макет.ПолучитьОбласть("ПодстрокаРасшифровки");
					СчетчикСтрок = 0;
					
					Для каждого Строка Из СтрокиДанных Цикл
						
						Если СчетчикСтрок = 0 Тогда
							
							ОбластьДанныеРаздел2.Параметры.Заполнить(Строка);
							ТаблицаРезультат.Вывести(ОбластьДанныеРаздел2);
							
						Иначе
							ОбластьПодСтрока.Параметры.Заполнить(Строка);
							ТаблицаРезультат.Вывести(ОбластьПодСтрока);
						КонецЕсли; 
						
						СчетчикСтрок = СчетчикСтрок + 1;
					КонецЦикла; 
				Иначе
					ОбластьДанныеРаздел2.Параметры.Заполнить(СтрокиДанных[0]);
					// БИТ_ЖКХ добавление кода Начало: 08.06.2012 
					Если ЗначениеЗаполнено(АдресПрибытияИзСправочника) Тогда
						
						ОбластьДанныеРаздел2.Параметры.КогдаИОткудаПрибыл = АдресПрибытияИзСправочника;
						
					КонецЕсли; 
					// БИТ_ЖКХ добавление кода конец : 08.06.2012
					ТаблицаРезультат.Вывести(ОбластьДанныеРаздел2);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

// БИТ ЖКХ 27.01.2021
Функция ПолучитьАдресДляСправки (стрАдреса)
	
  строкаАдреса = "";
  
  попытка
   ЧтениеJSON = Новый ЧтениеJSON;
   ЧтениеJSON.УстановитьСтроку(стрАдреса);
   address = ПрочитатьJSON(ЧтениеJSON, ложь);	
   ЧтениеJSON.Закрыть();
  исключение
   возврат ""; 
  конецпопытки; 
  
  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "area") = истина тогда
   строкаАдреса = строкаАдреса + строка(address.area);  	  
  конецесли;

  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "areaType") = истина тогда
   строкаАдреса = строкаАдреса + " " + строка(address.areaType);  	  
  конецесли;

  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "district") = истина тогда
   строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.district);  	  
  конецесли;

  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "districtType") = истина тогда
   строкаАдреса = строкаАдреса + " " + строка(address.districtType);  	  
  иначе
	  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "district") = истина тогда
		строкаАдреса = строкаАдреса + " р-н"; 
      конецесли;
  конецесли;

  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "city") = истина тогда
	  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "districtType") = истина тогда
		строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса);  
	  конецесли;       	  
   строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.city);  	  
  конецесли;

  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "cityType") = истина тогда
   строкаАдреса = строкаАдреса + " " + строка(address.cityType);  	  
  конецесли;
  
  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "locality") = истина тогда
   строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.locality);  	  
  конецесли;

  возврат строкаАдреса;	
		

конецфункции	
			  
// БИТ ЖКХ 27.01.2021
функция ДобавитьРазделитель(ЗначениеИзСтроки)
	
	если ЗначениеЗаполнено(ЗначениеИзСтроки) = истина тогда
		возврат ", ";
	конецесли;
	
конецфункции

//  Функция получает адрес из контактной информации.
//
Функция ПодробныйАдрес(Объект)
	
	// БИТ_ЖКХ 01.12.2010. 
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	ЗапросАдрес = Новый Запрос;
	ЗапросАдрес.УстановитьПараметр("Объект" , Объект);
	ЗапросАдрес.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК Индекс,
	|	КонтактнаяИнформация.Поле2 КАК Регион,
	|	КонтактнаяИнформация.Поле3 КАК Район,
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	|	КонтактнаяИнформация.Поле6 КАК Улица,
	|	КонтактнаяИнформация.Поле7 КАК Дом,
	|	КонтактнаяИнформация.Поле8 КАК Корпус,
	|	КонтактнаяИнформация.Поле9 КАК Квартира,
	|	КонтактнаяИнформация.Поле10 КАК Страна,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры,
	|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания)";
	
	Выборка = ЗапросАдрес.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции 

// Процедура проверяет заполнение реквизитов.
//
Процедура ПроверкаШапки(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнен лицевой счет.");
		
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнена дата.");
		
		Отказ = Истина;
		
	КонецЕсли; 	
	
КонецПроцедуры

// Функция формирует таблицу значений данных проживающих на ЛС.
Функция ФормироватьСписокОсновныхДанных() Экспорт 
	
	// БИТ_ЖКХ_09082013_изменение
	// Добавлена информация из регистра сведений "бит_ВоинскийУчет".
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СписокФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ СписокФизЛиц
	|ИЗ
	|	&СписокФизЛиц КАК СписокФизЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛиц.ФизЛицо,
	|	СписокФизЛиц.ФизЛицо.МестоРождения КАК МестоРождения,
	|	бит_ДопСведенияОПроживающихСрезПоследних.ВидСведений,
	|	бит_ДопСведенияОПроживающихСрезПоследних.Значение,
	|	СписокФизЛиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ГражданствоФизЛицСрезПоследних.Страна КАК Гражданство,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира КАК Квартира,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ДатаДокумента КАК ПравоустанавливающиеДокументыДата,
	|	ВоинскийУчетФизЛицСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	ВоинскийУчетФизЛицСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета,
	|	ВоинскийУчетФизЛицСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	ВоинскийУчетФизЛицСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	ТрудоваяДеятельностьПроживающихФизЛицСрезПоследних.РодЗанятий,
	|	ТрудоваяДеятельностьПроживающихФизЛицСрезПоследних.МестоРаботы,
	|	ТрудоваяДеятельностьПроживающихФизЛицСрезПоследних.Должность,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади
	|ИЗ
	|	СписокФизЛиц КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|				&Дата,
	|				ЛицевойСчет = &ЛицевойСчет
	|					И ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|						ИЗ
	|							СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК ГражданствоФизЛицСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВоинскийУчет.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК ВоинскийУчетФизЛицСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = ВоинскийУчетФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ТрудоваяДеятельностьПроживающих.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК ТрудоваяДеятельностьПроживающихФизЛицСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = ТрудоваяДеятельностьПроживающихФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДопСведенияОПроживающих.СрезПоследних(
	|				&Дата,
	|				Проживающий В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ДопСведенияОПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ДопСведенияОПроживающихСрезПоследних.Проживающий";	
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	// БИТ_ЖКХ добавление кода Начало: 26.06.2012 
	Если  мСписокФизЛиц =Неопределено Тогда
		мСписокФизЛиц = СписокПроживающих();
	КонецЕсли;
	// БИТ_ЖКХ добавление кода конец : 26.06.2012
	Запрос.УстановитьПараметр("СписокФизЛиц", мСписокФизЛиц);//.ВыгрузитьКолонку("ФизическоеЛицо"));
	
	ТаблицаПроживающих = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаПроживающих;
	
КонецФункции // ФормироватьСписокПроживающих()

// Функция формирует список физ лиц, когда-либо прописанных на ЛС (ВесьСписок = Ложь).
// Либо тех, кто прописан на момент даты документа (ВесьСписок = Истина).
Функция  СписокПроживающих() Экспорт 
	
	// БИТ_ЖКХ изменения кода . Начало: 06.06.2012
	Если ЗначениеЗаполнено(Проживающий) Тогда
		Условие = " ГДЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = &ФизЛицо";
	Иначе
		Условие = "";
	КонецЕсли; 
	
	Если НЕ ИсторияПроживающих Тогда
		Если ЗначениеЗаполнено(Проживающий)Тогда
			Условие = Условие + " И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		Иначе
			Условие = "	ГДЕ (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		КонецЕсли;
	КонецЕсли;
	
	
	ТекстЗапроса = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Имя, """") КАК Имя,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Отчество, """") КАК Отчество
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Дата, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо" + Условие + "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Если ЗначениеЗаполнено(Проживающий) Тогда
		Запрос.УстановитьПараметр("ФизЛицо", Проживающий);
	КонецЕсли; 
	
	мСписокФизЛиц = Запрос.Выполнить().Выгрузить();
	
	Возврат мСписокФизЛиц;   
	// БИТ_ЖКХ изменения кода . Конец  06.06.2012
	
КонецФункции // СписокПроживающих()

// Функция формирует список адресов прибытия и убытия.                  
Функция АдресаПрибытияУбытия(Дата, ЛицевойСчет)
	
	СтрокаОткудаПрибыл	 = "";
	СтрокаКудаУбыл		 = "";
	Если НЕ ИсторияПрописки Тогда
		
		условие = " УБЫВ";
		
	Иначе
		
		условие = "";
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;                            
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ СписокФизЛиц
	|ИЗ
	|	&СписокФизЛиц КАК СписокФизЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛС.Период КАК Период,
	|	СписокФизЛиц.ФизЛицо,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.ДатаПрибытия,
	|	бит_ПроживающиеПоЛС.ОткудаПрибыл,
	|	бит_ПроживающиеПоЛС.ПричинаПрописки,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаЗаписи КАК ДатаОкончанияСтатуса,
	|	бит_ПроживающиеПоЛС.ПричинаВыписки,
	|	бит_ПроживающиеПоЛС.КудаВыписан,
	|	бит_ПроживающиеПоЛС.СтатусПроживания,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации
	|ИЗ
	|	СписокФизЛиц КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|		ПО СписокФизЛиц.ФизЛицо = бит_ПроживающиеПоЛС.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ПроживающиеПоЛС.Период <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"+условие + "";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("СписокФизЛиц", мСписокФизЛиц);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ТаблицаДанных.Колонки.Добавить("ФизЛицо" ,,"ФизЛицо");
	ТаблицаДанных.Колонки.Добавить("КогдаИОткудаПрибыл" ,,"КогдаИОткудаПрибыл");
	ТаблицаДанных.Колонки.Добавить("СтатусПроживания" ,,"СтатусПроживания");
	ТаблицаДанных.Колонки.Добавить("ДатаРегистрации" ,,"ДатаРегистрации");
	ТаблицаДанных.Колонки.Добавить("КудаВыписан" ,,"КудаВыписан");
	ТаблицаДанных.Колонки.Добавить("ДатаПрибытия" ,,"ДатаПрибытия");
	ТаблицаДанных.Колонки.Добавить("ДатаСнятияСРегистрации" ,,"ДатаСнятияСРегистрации");
	
	Для каждого ФизЛицо Из мСписокФизЛиц Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ФизЛицо",ФизЛицо.ФизЛицо);
		РезультатФизЛ = Результат.НайтиСтроки(Отбор);
		
		КогдаИОткудаПрибыл 	= "";
		КудаВыписан			= "";
		СтатусПроживания 	= "";
		КолвоЗаписей 		= РезультатФизЛ.Количество();
		
		Если ИсторияПрописки Тогда
			
			Если КолвоЗаписей > 0 Тогда
				
				ДатаСравнения = РезультатФизЛ[0].ДатаРегистрации;
				НоваяСтрока = ТаблицаДанных.Добавить();
				
			КонецЕсли; 
			
			Для каждого Строка Из РезультатФизЛ Цикл
				КолвоЗаписей = КолвоЗаписей - 1;
				Если ДатаСравнения = Строка.ДатаРегистрации И КолвоЗаписей >= 0 Тогда
					
					// БИТ_ЖКХ 13.01.2015{{
					// Если НЕ ЗначениеЗаполнено(СтатусПроживания) Тогда.            
					СтатусПроживания = Строка.СтатусПроживания;
					// КонецЕсли;.
					// БИТ_ЖКХ 13.01.2015}}
					
					Если ЗначениеЗаполнено(Строка.ДатаСнятияСРегистрации) Тогда
						
						ДатаСнятияСРегистрации = Строка.ДатаСнятияСРегистрации;
						
					Иначе
						
						ДатаСнятияСРегистрации = Строка.ДатаОкончанияСтатуса;
						
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(КудаВыписан) Тогда
						
						КудаВыписан =  КудаВыписан
						+ ?(ЗначениеЗаполнено(ДатаСнятияСРегистрации),Формат(ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy")+ ", ","")
						+ ?(ЗначениеЗаполнено(Строка.ПричинаВыписки),Строка(Строка.ПричинаВыписки)+ " ","")
						+ ?(ЗначениеЗаполнено(Строка.КудаВыписан),Строка(Строка.КудаВыписан),"");
						Если ЗначениеЗаполнено(КудаВыписан) Тогда
							
							КудаВыписан = "Вып." + КудаВыписан;
							
						КонецЕсли; 
						
					Иначе
						НовыеДанные = ?(ЗначениеЗаполнено(ДатаСнятияСРегистрации),Формат(ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy")+ ", ","")
						+ ?(ЗначениеЗаполнено(Строка.ПричинаВыписки),Строка(Строка.ПричинаВыписки)+ " ","")
						+ ?(ЗначениеЗаполнено(Строка.КудаВыписан),Строка(Строка.КудаВыписан),"");
						Если ЗначениеЗаполнено(НовыеДанные) Тогда
							
							КудаВыписан =  КудаВыписан + Символы.ПС + "Вып."+ НовыеДанные;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					Если НЕ ЗначениеЗаполнено(КогдаИОткудаПрибыл) Тогда
						
						КогдаИОткудаПрибыл =  КогдаИОткудаПрибыл
						+ ?(ЗначениеЗаполнено(Строка.ДатаРегистрации),Формат(Строка.ДатаРегистрации,"ДФ=dd.MM.yyyy")+ ", ","")
						+ ?(ЗначениеЗаполнено(Строка.ОткудаПрибыл),Строка(Строка.ОткудаПрибыл)+ ",","")
						+ ?(ЗначениеЗаполнено(Строка.ПричинаПрописки),Строка(Строка.ПричинаПрописки),"");
						
					КонецЕсли; 
				КонецЕсли; 
				
				Если (ДатаСравнения <> Строка.ДатаРегистрации И КолвоЗаписей > 0) ИЛИ (ДатаСравнения = Строка.ДатаРегистрации И КолвоЗаписей = 0)Тогда 
					НоваяСтрока.ДатаРегистрации 	= ДатаСравнения;
					
					Если СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно Тогда
						
						НоваяСтрока.СтатусПроживания 	= "Пост.";
						
						
					ИначеЕсли СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно Тогда
						
						НоваяСтрока.СтатусПроживания 	= "Врем.";
						
					Иначе 	
						НоваяСтрока.СтатусПроживания 	= Строка(СтатусПроживания);
						
					КонецЕсли; 
					НоваяСтрока.КогдаИОткудаПрибыл	 	= КогдаИОткудаПрибыл;
					НоваяСтрока.КудаВыписан		 		= КудаВыписан;
					НоваяСтрока.ФизЛицо		 			= ФизЛицо.ФизЛицо;
					НоваяСтрока.ДатаПрибытия			= Строка.ДатаПрибытия;
					НоваяСтрока.ДатаСнятияСРегистрации	= ДатаСнятияСРегистрации;
					
					Если КолвоЗаписей <> 0 Тогда
						
						НоваяСтрока = ТаблицаДанных.Добавить();
						ДатаСравнения = Строка.ДатаРегистрации;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
		Иначе
			
			Если КолвоЗаписей > 0 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("ФизЛицо",ФизЛицо.ФизЛицо);
				Отбор.Вставить("ДатаРегистрации",РезультатФизЛ[0].ДатаРегистрации);
				ТаблицаСтрок = Результат.НайтиСтроки(Отбор);
				Если ТаблицаСтрок.Количество()>0 Тогда
					
					НоваяСтрока = ТаблицаДанных.Добавить();
					ОткудаПрибыл 			= "";
					КогдаИОткудаПрибыл 		= "";
					КудаУбыл 				= "";
					КудаВыписан 			= "";
					ДатаРегистрации     	= ТаблицаСтрок[0].ДатаРегистрации;
					СтатусПроживания		= "";
					ДатаПрибытия        	= ТаблицаСтрок[0].ДатаПрибытия;
					ДатаСнятияСРегистрации 	= ТаблицаСтрок[0].ДатаСнятияСРегистрации;
					
					Для каждого Строка Из ТаблицаСтрок Цикл
						КудаУбыл = КудаУбыл 
						+ ?(ЗначениеЗаполнено(Строка.ПричинаВыписки),Строка(Строка.ПричинаВыписки)+ " ","")
						+ ?(ЗначениеЗаполнено(Строка.КудаВыписан),Строка(Строка.КудаВыписан),"");
						Если ЗначениеЗаполнено(КудаУбыл) Тогда
							Если НЕ ЗначениеЗаполнено(КудаВыписан) Тогда
								ДатаПрибытия = Строка.ДатаПрибытия;
								КудаВыписан = КудаВыписан 
								+ ?(ЗначениеЗаполнено(Строка.ДатаСнятияСРегистрации),Формат(Строка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy")+ ", ","")
								+ КудаУбыл;
								Прервать;
							иначе
								Прервать; 
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла; 
					
				КонецЕсли; 
				
				Индекс = ТаблицаСтрок.Количество() - 1 ;
				Пока Индекс >= 0 Цикл
					Строка = ТаблицаСтрок[Индекс];
					ОткудаПрибыл = ОткудаПрибыл
					+ ?(ЗначениеЗаполнено(Строка.ОткудаПрибыл),Строка(Строка.ОткудаПрибыл)+ ",","")
					+ ?(ЗначениеЗаполнено(Строка.ПричинаПрописки),Строка(Строка.ПричинаПрописки),"");
					
					СтатусПроживания = Строка(Строка.СтатусПроживания);
					Если  ЗначениеЗаполнено(ОткудаПрибыл) Тогда
						Если НЕ ЗначениеЗаполнено(КогдаИОткудаПрибыл) Тогда
							
							КогдаИОткудаПрибыл =  КогдаИОткудаПрибыл
							+ ?(ЗначениеЗаполнено(Строка.ДатаРегистрации),Формат(Строка.ДатаРегистрации,"ДФ=dd.MM.yyyy")+ ", ","")
							+ ОткудаПрибыл;
							Прервать;
						Иначе
							Прервать;
						КонецЕсли; 	
						
					КонецЕсли; 
					
					Индекс = Индекс - 1;
					
				КонецЦикла; 
				
				НоваяСтрока.КогдаИОткудаПрибыл 		= КогдаИОткудаПрибыл;
				НоваяСтрока.СтатусПроживания 		= СтатусПроживания;
				НоваяСтрока.ДатаРегистрации 		= ДатаРегистрации;
				НоваяСтрока.КудаВыписан 			= КудаВыписан;
				НоваяСтрока.ФизЛицо 				= ФизЛицо.ФизЛицо;
				НоваяСтрока.ДатаПрибытия			= ДатаПрибытия;
				НоваяСтрока.ДатаСнятияСРегистрации	= ДатаСнятияСРегистрации;
				
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЦикла;
	Возврат ТаблицаДанных;
	
КонецФункции

// БИТ_ЖКХ добавление кода Начало: 14.06.2012 
// Список всех владельцев жилья.
Функция СписокВладельцев()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Фамилия + "" "" + бит_ФИОПроживающихСрезПоследних.Имя + "" "" + бит_ФИОПроживающихСрезПоследних.Отчество, бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ДатаДокумента КАК ПравоустанавливающиеДокументыДата
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	// БИТ_ЖКХ 21.03.2017 11:55:42 Начало правки... 
	|ГДЕ
	|	НЕ бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)";
	// БИТ_ЖКХ 21.03.2017 11:55:43 Конец правки. 
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", Дата);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции
// БИТ_ЖКХ добавление кода конец : 14.06.2012

#КонецОбласти
